/**************
 * 
 * 这个文件记录一些比较重要的信息
 * 
 * 
 * cnblog  用户名gongzhuiau       email:gongzhuiau@163.com           密码：有数字字母和特殊字符。
 * 
 * 
 * 1...   app.rpcinvoke is not a function        adminServer.json 配置错误。一般出现框架错误都是配置错误。            
 * 
 * 
 * 
 * 1, 黑白棋。
 * 2，洛河寻宝，夺宝奇兵bug -------
 * 3， 夺宝
 * 4， 李银获取房间信息接口。---
 * 5， 月卡，               ------                            5，  4， 3
 * 
 * 
 * 1,betConfig[0] 要跟底分相同
 * 
 * 
 * 1. 洛河寻宝，夺宝奇兵 的稳定             ok
 * 2. 黑白棋 先构思下主要思路，再 去写，不然要重写2遍     ok
 * 3. 李银的接口          ok
 * 4. 夺宝                         ok
 * 5，刘巧玲的微信支付。            ok
 * 
 * 
 * 新任务：
 * 1，李银的小游戏破产
 * 2. 夺宝机器人的添加
 * 
 * 3. 夺宝奇兵夺宝后奖励分布随机
 * 
 * 4, 分享文档加
 * 
 * 
 * 1, 夺宝 http后台接口+字段， 机器人， 限制个人购买, wait  ok
 * 
 * 2，李银小游戏破产        ok
 * 
 * 3， 夺宝奇兵 优化测试   ok
 * 
 * 4， 分享得奖励提交。  ok       分享联调 wait
 * 
 * 5, 重写单款返回的分数     等联调


 大白菜5.1版本可用。密码 dabaicai.com


 
 */











 1, 再检查检查黑白棋。
 * 
 */
